code-review/NRB_3471_3546/База_Стало/Documents/КарточкаОферты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>КарточкаОферты</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЦеннаяБумага</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОферты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорпоративноеДействие</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.КорпоративноеДействие_Новый</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаПриемаУведомлений</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияПриемаУведомлений</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресДляПриемаУведомлений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>130</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаПриобретения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяВыставленияЗаявокНаПродажуНачало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяВыставленияЗаявокНаПродажуОкончание</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяВыставленияВстречныхЗаявокНачало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяВыставленияВстречныхЗаявокОкончание</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимТорогов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодРасчетов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеАгентаНаМосбирже</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>130</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодУчастникаТоргов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактныеЛицаАгента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EMailДляОтправкиУведомлений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсобыеУсловия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>130</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КарточкаОфертыОформлена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОформлениеКарточкиОфертыИсполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОформлениеКарточкиОфертыДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КарточкаОфертыПроверена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверилКарточкуОфертыИсполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверилКарточкуОфертыДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаявкаАгентуНаПроверкуНаправлена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеЗаявкаАгентуНаПроверкуИсполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеЗаявкаАгентуНаПроверкуДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АгентСогласовалФормуЗаявки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СогласованиеФормыЗаявкиАгентомИсполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СогласованиеФормыЗаявкиАгентомДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОригиналЗаявкиАгентуНаправлен</Name>
					<Comment>Направил оригинал заявки агенту/ скан (если оригинал не требуется)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеОригиналаЗаявкиАгентуИсполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеОригиналаЗаявкиАгентуДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоступилаОтметкаОПолученииОригинала</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтметкиОПолученииОригиналаИсполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтметкаОПолученииОригиналаДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СообщенияФОиКМНаправлены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеСообщенийФОиКМИсполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеСообщенийФОиКМДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроведенаПроверкаКД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверкаКДИсполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверкаКДДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменил</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/InformationRegisters/УведомленияОтправленныеЧерезЛичныйКабинет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>УведомленияОтправленныеЧерезЛичныйКабинет</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоЦБ</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>СтатусДоставкиУведомления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыДоставкиУведомленийВКабинетКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тело</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>КД</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗапросСубброкеруНаРаскрытие</v8:Type>
						<v8:Type>cfg:DocumentRef.РаскрытиеСпискаВладельцев</v8:Type>
						<v8:Type>cfg:DocumentRef.Поручение</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявлениеНаУчастиеВОферте</v8:Type>
						<v8:Type>cfg:TaskRef.ОбработкаWTRCСообщения</v8:Type>
						<v8:Type>cfg:DocumentRef.СводныйОтчетОСовершенныхОперациях</v8:Type>
						<v8:Type>cfg:DocumentRef.КорпоративноеДействие_Новый</v8:Type>
						<v8:Type>cfg:DocumentRef.УведомлениеКлиентам</v8:Type>
						<v8:Type>cfg:BusinessProcessRef.ОбработкаWTRCСообщения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДепо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РазделСчетаДепо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделыСчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦеннаяБумага</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторУведомления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/Documents/КарточкаОферты/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	BPUT = Справочники.ВидыКорпоративныхДействий.ДосрочноеПогашениеОблигацийПоТребованиюВладельца;
	НовыйПараметр = Новый ПараметрВыбора("Отбор.ВидКД", BPUT);
	НовыйМассив = Новый Массив();
	НовыйМассив.Добавить(НовыйПараметр);
	НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
	Элементы.КорпоративноеДействие.ПараметрыВыбора = НовыеПараметры;
	ПолучитьЮрлицоАффилированнойУКЕслиОноЕщеНеизвестно();
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ПолучитьЮрлицоАффилированнойУКЕслиОноЕщеНеизвестно();
	ЗаполнитьСписокЗаявленийНаУчастиеВОферте(ТекущийОбъект.Ссылка);
	ОригиналЗаявкиАгентуУжеБылНаправлен = ТекущийОбъект.ОригиналЗаявкиАгентуНаправлен;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если Не ПроверитьЗаполнение() Тогда
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если Не ОригиналЗаявкиАгентуУжеБылНаправлен И ТекущийОбъект.ОригиналЗаявкиАгентуНаправлен Тогда
		ОтправитьУведомлениеОНаправленииАгентуОригиналаЗаявки(Отказ, ТекущийОбъект.Ссылка);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ЗаполнитьСписокЗаявленийНаУчастиеВОферте(ТекущийОбъект.Ссылка);
	ОригиналЗаявкиАгентуУжеБылНаправлен = ТекущийОбъект.ОригиналЗаявкиАгентуНаправлен;
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КорпоративноеДействиеПриИзменении(Элемент)
	КорпоративноеДействиеПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ДатаОфертыПриИзменении(Элемент)
	ДатаОфертыПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура КарточкаОфертыОформленаПриИзменении(Элемент)
	УстановитьИсполнителяИДату(Объект.КарточкаОфертыОформлена, Объект.ОформлениеКарточкиОфертыИсполнитель,
								Объект.ОформлениеКарточкиОфертыДата);
КонецПроцедуры

&НаКлиенте
Процедура КарточкаОфертыПроверенаПриИзменении(Элемент)
	УстановитьИсполнителяИДату(Объект.КарточкаОфертыПроверена, Объект.ПроверилКарточкуОфертыИсполнитель,
								Объект.ПроверилКарточкуОфертыДата);
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкаАгентуНаПроверкуНаправленаПриИзменении(Элемент)
	УстановитьИсполнителяИДату(Объект.ЗаявкаАгентуНаПроверкуНаправлена, Объект.НаправлениеЗаявкаАгентуНаПроверкуИсполнитель,
								Объект.НаправлениеЗаявкаАгентуНаПроверкуДата);
КонецПроцедуры

&НаКлиенте
Процедура АгентСогласовалФормуЗаявкиПриИзменении(Элемент)
	УстановитьИсполнителяИДату(Объект.АгентСогласовалФормуЗаявки, Объект.СогласованиеФормыЗаявкиАгентомИсполнитель,
								Объект.СогласованиеФормыЗаявкиАгентомДата);
КонецПроцедуры

&НаКлиенте
Процедура ОригиналЗаявкиАгентуНаправленПриИзменении(Элемент)
	УстановитьИсполнителяИДату(Объект.ОригиналЗаявкиАгентуНаправлен, Объект.НаправлениеОригиналаЗаявкиАгентуИсполнитель,
								Объект.НаправлениеОригиналаЗаявкиАгентуДата);
КонецПроцедуры

&НаКлиенте
Процедура ПоступилаОтметкаОПолученииОригиналаПриИзменении(Элемент)
	УстановитьИсполнителяИДату(Объект.ПоступилаОтметкаОПолученииОригинала, Объект.ОтметкиОПолученииОригиналаИсполнитель,
								Объект.ОтметкаОПолученииОригиналаДата);
КонецПроцедуры

&НаКлиенте
Процедура СообщенияФОиКМНаправленыПриИзменении(Элемент)
	УстановитьИсполнителяИДату(Объект.СообщенияФОиКМНаправлены, Объект.НаправлениеСообщенийФОиКМИсполнитель,
								Объект.НаправлениеСообщенийФОиКМДата);
КонецПроцедуры

&НаКлиенте
Процедура ПроведенаПроверкаКДПриИзменении(Элемент)
	УстановитьИсполнителяИДату(Объект.ПроведенаПроверкаКД, Объект.ПроверкаКДИсполнитель, Объект.ПроверкаКДДата);
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормыУчастникиОферты

&НаКлиенте
Процедура УчастникиОфертыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Строка = УчастникиОферты.НайтиПоИдентификатору(ВыбраннаяСтрока);
	ПоказатьЗначение(, Строка.ЗаявлениеНаУчастиеВОферте);
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьСписокУчастников(Команда)
	ЗаполнитьСписокЗаявленийНаУчастиеВОферте(Объект.Ссылка);
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьСписокЗаявленийНаУчастиеВОферте(КарточкаОферты)
	УчастникиОферты.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаявлениеНаУчастиеВОферте.Ссылка КАК ЗаявлениеНаУчастиеВОферте,
	|	ЗаявлениеНаУчастиеВОферте.Клиент КАК Клиент,
	|	ЗаявлениеНаУчастиеВОферте.ДоговорКлиента КАК ДоговорКлиента,
	|	ЗаявлениеНаУчастиеВОферте.КоличествоЦБ КАК КоличествоЦБ,
	|	МАКСИМУМ(УведомленияОтправленныеЧерезЛичныйКабинет.Период) КАК ДатаОтправкиУведомления
	|ПОМЕСТИТЬ ВТ_Участники
	|ИЗ
	|	Документ.ЗаявлениеНаУчастиеВОферте КАК ЗаявлениеНаУчастиеВОферте
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УведомленияОтправленныеЧерезЛичныйКабинет КАК УведомленияОтправленныеЧерезЛичныйКабинет
	|		ПО УведомленияОтправленныеЧерезЛичныйКабинет.КД = ЗаявлениеНаУчастиеВОферте.Ссылка
	|ГДЕ
	|	ЗаявлениеНаУчастиеВОферте.КарточкаОферты = &КарточкаОферты
	|	И НЕ ЗаявлениеНаУчастиеВОферте.ПометкаУдаления
	|СГРУППИРОВАТЬ ПО
	|	ЗаявлениеНаУчастиеВОферте.Ссылка,
	|	ЗаявлениеНаУчастиеВОферте.Клиент,
	|	ЗаявлениеНаУчастиеВОферте.ДоговорКлиента,
	|	ЗаявлениеНаУчастиеВОферте.КоличествоЦБ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Поручение.Ссылка КАК ЗаявлениеНаУчастиеВОферте,
	|	ВЫРАЗИТЬ(Поручение.Депонент КАК Справочник.Контрагенты) КАК Клиент,
	|	NULL КАК ДоговорКлиента,
	|	Поручение.КоличествоЦБ КАК КоличествоЦБ,
	|	NULL КАК ДатаОтправкиУведомления
	|ИЗ Документ.КарточкаОферты КАК КарточкаОферты
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Поручение КАК Поручение
	|		ПО КарточкаОферты.КорпоративноеДействие = Поручение.КарточкаКД
	|		И Поручение.ВидОперацииД = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.УчастиеВКД)
	|		И КарточкаОферты.Ссылка = &КарточкаОферты
	|		И КарточкаОферты.КорпоративноеДействие <> ЗНАЧЕНИЕ(Документ.КорпоративноеДействие_Новый.ПустаяСсылка)
	|;
	|
	|/////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Участники.ЗаявлениеНаУчастиеВОферте КАК ЗаявлениеНаУчастиеВОферте,
	|	ВТ_Участники.Клиент КАК Клиент,
	|	ВЫБОР 
	|		КОГДА ВТ_Участники.Клиент.ЮридическиеФизическиеЛица = &ЮрлицоАффилированнойУК ТОГДА Истина
	|		ИНАЧЕ Ложь
	|	КОНЕЦ КАК ЧерезАффилированнуюУК,
	|	ВТ_Участники.ДоговорКлиента КАК Договор,
	|	ДоговорыКлиентов.Наименование КАК НаименованиеДоговора,
	|	Клиенты.Код КАК КодКлиента,
	|	Клиенты.ЮридическиеФизическиеЛица КАК ЮридическиеФизическиеЛица,
	|	ВЫРАЗИТЬ(Клиенты.НаименованиеПолное КАК Строка(500)) КАК ПолноеНаименованиеКлиента,
	|	ВТ_Участники.КоличествоЦБ КАК КоличествоЦБ,
	|	МАКСИМУМ(ВЫБОР 
	|				КОГДА ДоговорыКонтрагентов.Ссылка ЕСТЬ NULL ТОГДА ЛОЖЬ ИНАЧЕ ИСТИНА
	|			 КОНЕЦ) КАК ЯвляетсяДепонентом,
	|	ВТ_Участники.ДатаОтправкиУведомления КАК ДатаОтправкиУведомления,
	|	МАКСИМУМ(УведомленияОтправленныеЧерезЛичныйКабинет.СтатусДоставкиУведомления) КАК СтатусДоставкиУведомления
	|ИЗ ВТ_Участники
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Клиенты
	|		ПО ВТ_Участники.Клиент = Клиенты.Ссылка
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКлиентов
	|		ПО ВТ_Участники.ДоговорКлиента = ДоговорыКлиентов.Ссылка
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО 	ДоговорыКонтрагентов.Владелец = ВТ_Участники.Клиент
	|			И ДоговорыКонтрагентов.ТипДоговора В (&ТипыДоговоровДепонента)
	|			И (ДоговорыКонтрагентов.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	|				ИЛИ ДоговорыКонтрагентов.ДатаОкончанияДействия > &ТекущаяДата)
	|			И НЕ ДоговорыКонтрагентов.ПометкаУдаления
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УведомленияОтправленныеЧерезЛичныйКабинет КАК УведомленияОтправленныеЧерезЛичныйКабинет
	|		ПО УведомленияОтправленныеЧерезЛичныйКабинет.КД = ВТ_Участники.ЗаявлениеНаУчастиеВОферте
	|			И УведомленияОтправленныеЧерезЛичныйКабинет.Период = ВТ_Участники.ДатаОтправкиУведомления
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Участники.ЗаявлениеНаУчастиеВОферте,
	|	ВТ_Участники.Клиент,
	|	ВТ_Участники.ДоговорКлиента,
	|	ДоговорыКлиентов.Наименование,
	|	Клиенты.Код,
	|	Клиенты.ЮридическиеФизическиеЛица,
	|	ВЫРАЗИТЬ(Клиенты.НаименованиеПолное КАК Строка(500)),
	|	ВТ_Участники.КоличествоЦБ,
	|	ВТ_Участники.ДатаОтправкиУведомления
	|УПОРЯДОЧИТЬ ПО 
	|	ВЫРАЗИТЬ(Клиенты.НаименованиеПолное КАК Строка(500))
	|";
	Запрос.УстановитьПараметр("КарточкаОферты", КарточкаОферты);
	Запрос.УстановитьПараметр("ТипыДоговоровДепонента", Справочники.Контрагенты.ТипыДоговоровДепонента());
	Запрос.УстановитьПараметр("ТекущаяДата", НачалоДня(ТекущаяДатаСеанса() ) );
	Запрос.УстановитьПараметр("ЮрлицоАффилированнойУК", ЮрлицоАффилированнойУК);
	
	Выборка = Запрос.Выполнить().Выбрать();
	ИтоговоеКоличествоЦБ = 0;
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = УчастникиОферты.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		НоваяСтрока.НаименованиеДоговора = СокрЛП(НоваяСтрока.НаименованиеДоговора);
		КоличествоПрописью = ЧислоПрописью(Выборка.КоличествоЦБ);
		Если Цел(Выборка.КоличествоЦБ) = Выборка.КоличествоЦБ Тогда
			КоличествоПрописью = СокрЛП(СтрЗаменить(КоличествоПрописью, "00", ""));
		КонецЕсли;
		НоваяСтрока.КоличествоПрописью = КоличествоПрописью;
		ИтоговоеКоличествоЦБ = ИтоговоеКоличествоЦБ + Выборка.КоличествоЦБ;
	КонецЦикла;
	
	Если УчастникиОферты.Количество() > 0 И ЗначениеЗаполнено(Объект.ЦеннаяБумага) И ЗначениеЗаполнено(Объект.ДатаОферты) Тогда
		Элементы.ЦеннаяБумага.ТолькоПросмотр = Истина;
		Элементы.ДатаОферты.ТолькоПросмотр = Истина;
	КонецЕсли;
	Элементы.ГруппаУчастникиОферты.Заголовок = "Участники оферты (" + Строка(УчастникиОферты.Количество()) + ")";
КонецПроцедуры

&НаСервере
Процедура УстановитьИсполнителяИДату(ДействиеИсполнено, Исполнитель, Дата)
	Если ДействиеИсполнено Тогда
		Исполнитель = ПараметрыСеанса.ТекущийПользователь;
		Дата = ТекущаяДатаСеанса();
	Иначе
		Исполнитель = Неопределено;
		Дата = Неопределено;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ДатаОфертыПриИзмененииНаСервере()
	Если ЗначениеЗаполнено(Объект.КорпоративноеДействие)
			И НачалоДня(Объект.КорпоративноеДействие.ДатаПроведенияСобрания) <> Объект.ДатаОферты Тогда
		Объект.КорпоративноеДействие = Неопределено;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура КорпоративноеДействиеПриИзмененииНаСервере()
	Если ЗначениеЗаполнено(Объект.КорпоративноеДействие)
			И НачалоДня(Объект.КорпоративноеДействие.ДатаПроведенияСобрания) <> Объект.ДатаОферты Тогда
		Если ЗначениеЗаполнено(Объект.ДатаОферты) Тогда
			ТекстСообщения = "Данное корпоративное действие не может быть выбрано - дата проведения собрания,"
							 + " указанная в корпоративном действии, отличается от даты оферты указанной в карточке оферты";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Объект.КорпоративноеДействие = Неопределено;
		Иначе
			Объект.ДатаОферты = Объект.КорпоративноеДействие.ДатаПроведенияСобрания;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОтправитьУведомлениеОНаправленииАгентуОригиналаЗаявки(Отказ, ТекущийОбъектСсылка)
	ВнешнийИсточник = ПланыВидовХарактеристик.ВнешниеИсточники.РассылкаУведомленийОНаправленииАгентуОригиналаЗаявкиНаУчастиеВОферте;
	НастройкиОбмена = ВнешниеДанные.ПолучитьПараметрыВнешнегоИсточника(ВнешнийИсточник).Настройка;
	Если НастройкиОбмена = Неопределено Тогда
		ТекстОшибки = "Не заданы параметры внешнего источника """ + Строка(ВнешнийИсточник) + """";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		ИмяСобытия = "Уведомление о направлении агенту оригинала заявки не отправлено";
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки);
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ТемаПисьма = "Уведомление об участии в оферте";
	ТекстПисьма = ТекстУведомленияОНаправленииАгентуОригиналаЗаявки(ТекущийОбъектСсылка);
	
	ПараметрыУведомления = Новый Соответствие;
	ПараметрыУведомления.Вставить("Вложения",			Неопределено);
	ПараметрыУведомления.Вставить("НастройкиОбмена",	НастройкиОбмена);
	ПараметрыУведомления.Вставить("Кодировка",			"UTF-8");
	ПараметрыУведомления.Вставить("ТемаПисьма",			ТемаПисьма);
	ПараметрыУведомления.Вставить("ТекстПисьма",		ТекстПисьма);
	ПараметрыУведомления.Вставить("ТипТекстаПисьма",	ТипТекстаПочтовогоСообщения.HTML);
	ПараметрыУведомления.Вставить("Важность",			ВажностьИнтернетПочтовогоСообщения.Обычная);
	
	РегистрыСведений.УведомленияКОтправке.ДобавитьУведомлениеКотправке(ПараметрыУведомления);
КонецПроцедуры

&НаСервере
Функция ТекстУведомленияОНаправленииАгентуОригиналаЗаявки(ТекущийОбъектСсылка)
	Организация = Константы.ОрганизацияПоУмолчанию.Получить();
	ПС = "<br>";		// Тег HTML означает перевод строки
	ВклBold = "<b>";	// Тег HTML означает включить жирный шрифт
	ОтклBold = "</b>";	// Тег HTML означает отключить жирный шрифт
	
	РеквизитыЦБ = РеквизитыЦеннойБумагиДляУведомления(Объект.ЦеннаяБумага);
	
	ТекстЗаголовка = "Добрый день!" + ПС + ПС
		+ "Уведомление об участии в оферте." + ПС + Символы.ПС
		+ "Оферта: " + Строка(РеквизитыЦБ.ТипЦБ) + " " + ВклBold + Строка(РеквизитыЦБ.Эмитент) + ОтклBold + ", "
		+ "ISIN " + ВклBold + РеквизитыЦБ.ISIN + ОтклBold + ", "
		+ "регистрационный номер: " + ВклBold + РеквизитыЦБ.НомерРегистрации + ОтклBold + ", "
		+ " от " + ВклBold + Формат(РеквизитыЦБ.ДатаГосРег, "ДФ=""дд.ММ.гггг""") + ОтклBold
		+ ПС + Символы.ПС;
	ДанныеРегламентаОфертыТаблицаHTML = ДанныеРегламентаОфертыВФормеТаблицыHTML();
	Текст = "<html><BODY>" + Символы.ПС
			+ ТекстЗаголовка + ПС + Символы.ПС
			+ ВклBold + "Регламент оферты" + ОтклBold + ПС + ДанныеРегламентаОфертыТаблицаHTML + ПС + Символы.ПС;
			
	ТЗУчастникиЧерезБрокера = УчастникиОферты.Выгрузить(Новый Структура("ЧерезАффилированнуюУК", Ложь), "КодКлиента, КоличествоЦБ");
	ТЗУчастникиЧерезУК = УчастникиОферты.Выгрузить(Новый Структура("ЧерезАффилированнуюУК", Истина), "КодКлиента, КоличествоЦБ");
	ПараметрыТрансформацииВHTML = Новый Структура;
	ПараметрыТрансформацииВHTML.Вставить("ПунктПорядкуИспользуется", Истина);
	ПараметрыТрансформацииВHTML.Вставить("ШиринаТаблицы", "430");
	ПараметрыТрансформацииВHTML.Вставить("Ширина1", "250");
	ПараметрыТрансформацииВHTML.Вставить("Ширина2", "180");
	ПараметрыТрансформацииВHTML.Вставить("ЦветШапки", "eadbaf");
	ПараметрыТрансформацииВHTML.Вставить("Заголовок1", "Код клиента");
	ПараметрыТрансформацииВHTML.Вставить("Заголовок2", "Количество, шт");
	ПараметрыТрансформацииВHTML.Вставить("Положение2", "right");
	
	Если ТЗУчастникиЧерезБрокера.Количество() > 0 Тогда
		УчастникиЧерезБрокераТаблицаHTML = ОбщегоНазначения.ТаблицаЗначенийВТаблицуHTML(ТЗУчастникиЧерезБрокера, ПараметрыТрансформацииВHTML);
		Текст = Текст + ВклBold + "Участники через " + Строка(Организация) + ПС + УчастникиЧерезБрокераТаблицаHTML + ОтклBold + ПС + Символы.ПС;
	КонецЕсли;
	Если ТЗУчастникиЧерезУК.Количество() > 0 Тогда
		УчастникиЧерезУКТаблицаHTML = ОбщегоНазначения.ТаблицаЗначенийВТаблицуHTML(ТЗУчастникиЧерезУК, ПараметрыТрансформацииВHTML);
		Текст = Текст + ВклBold + "Участники (выставление заявок не требуется)" + ПС + УчастникиЧерезУКТаблицаHTML + ОтклBold + ПС + Символы.ПС;
	КонецЕсли;
	
	Текст = Текст + "</BODY></html>";
	
	Возврат Текст;
КонецФункции

&НаСервереБезКонтекста
Функция РеквизитыЦеннойБумагиДляУведомления(ЦеннаяБумага)
	Если ЗначениеЗаполнено(ЦеннаяБумага) Тогда
		РеквизитыЦБ = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЦеннаяБумага, "ТипЦБ, Эмитент, ISIN, НомерРегистрации, ДатаГосРег");
	Иначе
		РеквизитыЦБ = Новый Структура;
		РеквизитыЦБ.Вставить("ТипЦБ", "");
		РеквизитыЦБ.Вставить("Эмитент", "");
		РеквизитыЦБ.Вставить("ISIN", "");
		РеквизитыЦБ.Вставить("НомерРегистрации", "");
		РеквизитыЦБ.Вставить("ДатаГосРег", "");
	КонецЕсли;
	
	Возврат РеквизитыЦБ;
КонецФункции

&НаСервере
Функция ДанныеРегламентаОфертыВФормеТаблицыHTML()
	ТЗРегламентОферты = Новый ТаблицаЗначений;
	ТЗРегламентОферты.Колонки.Добавить("Наименование");
	ТЗРегламентОферты.Колонки.Добавить("Значение");
	
	ЦенаПриобретенияСтрокой = Строка(Объект.ЦенаПриобретения) + "% от номинальной стоимости";
	ВремяВыставленияЗаявокНаПродажу = ИнтервалВремениСтрокой(Объект.ВремяВыставленияЗаявокНаПродажуНачало, 
																Объект.ВремяВыставленияЗаявокНаПродажуОкончание);
	ВремяВыставленияВстречныхЗаявок = ИнтервалВремениСтрокой(Объект.ВремяВыставленияВстречныхЗаявокНачало, 
																Объект.ВремяВыставленияВстречныхЗаявокОкончание);
	
	ДобавитьСтрокуРегламента(ТЗРегламентОферты, "Агент по приобретению"				, Объект.НаименованиеАгентаНаМосбирже);
	ДобавитьСтрокуРегламента(ТЗРегламентОферты, "Код агента по приобретению"		, Объект.КодУчастникаТоргов);
	ДобавитьСтрокуРегламента(ТЗРегламентОферты, "Дата приобретения"					, Объект.ДатаОферты);
	ДобавитьСтрокуРегламента(ТЗРегламентОферты, "Цена приобретения"					, ЦенаПриобретенияСтрокой);
	ДобавитьСтрокуРегламента(ТЗРегламентОферты, "Время выставления в систему Торгов", ВремяВыставленияЗаявокНаПродажу);
	ДобавитьСтрокуРегламента(ТЗРегламентОферты, "Время выставления встречных заявок", ВремяВыставленияВстречныхЗаявок);
	ДобавитьСтрокуРегламента(ТЗРегламентОферты, "Режим торгов"						, Объект.РежимТорогов);
	ДобавитьСтрокуРегламента(ТЗРегламентОферты, "Код расчетов"						, Объект.КодРасчетов);
	
	ПараметрыТрансформацииВHTML = Новый Структура;
	ПараметрыТрансформацииВHTML.Вставить("ВыводитьШапку", Ложь);
	ПараметрыТрансформацииВHTML.Вставить("ШиринаТаблицы", "670");
	ПараметрыТрансформацииВHTML.Вставить("Ширина1", "270");
	ПараметрыТрансформацииВHTML.Вставить("Ширина2", "400");
	ПараметрыТрансформацииВHTML.Вставить("ЦветШапки", "eadbaf");
	
	ТаблицаHTML = ОбщегоНазначения.ТаблицаЗначенийВТаблицуHTML(ТЗРегламентОферты, ПараметрыТрансформацииВHTML);
	
	Возврат ТаблицаHTML;
КонецФункции

&НаСервереБезКонтекста
Функция ИнтервалВремениСтрокой(Начало, Окончание)
	ИнтервалСтрокой = "с " + Формат(Начало, "ДФ=""ЧЧ:мм""") + " до " + Формат(Окончание, "ДФ=""ЧЧ:мм""");
	
	Возврат ИнтервалСтрокой;
КонецФункции

&НаСервереБезКонтекста
Процедура ДобавитьСтрокуРегламента(ТЗРегламентОферты, Наименование, Значение)
	НоваяСтрокаТЗ = ТЗРегламентОферты.Добавить();
	НоваяСтрокаТЗ.Наименование = Наименование;
	НоваяСтрокаТЗ.Значение = Значение;
КонецПроцедуры

&НаСервере
Процедура ПолучитьЮрлицоАффилированнойУКЕслиОноЕщеНеизвестно()
	Если Не ЗначениеЗаполнено(ЮрлицоАффилированнойУК) Тогда
		ЮрлицоАффилированнойУК = Константы.ЮрлицоАффилированнойУК.Получить();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
